quiz/src/InformationRegisters/РезультатыКвиза/РезультатыКвиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыКвиза</name>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Квиз</name>
    <type>
      <types>DocumentRef.Квиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.Вопросы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

quiz/src/InformationRegisters/РезультатыКвиза/ManagerModule.bsl
Функция ПолучитьРезультатыКвиза(Квиз) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезультатыКвиза.Команда КАК Команда,
	|	РезультатыКвиза.Раунд КАК Раунд,
	|	СУММА(ВЫБОР
	|			КОГДА РезультатыКвиза.Принят
	|				ТОГДА РезультатыКвиза.Вопрос.КоличествоБаллов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоБаллов,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ РезультатыКвиза.Принят
	|				ТОГДА РезультатыКвиза.Вопрос.КоличествоБаллов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОтрицательныеБаллы
	|ИЗ
	|	РегистрСведений.РезультатыКвиза КАК РезультатыКвиза
	|ГДЕ
	|	РезультатыКвиза.Квиз = &Квиз
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатыКвиза.Команда,
	|	РезультатыКвиза.Раунд";
	
	Запрос.УстановитьПараметр("Квиз", Квиз);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции      

Функция ПолучитьРезультатыРаунда(Квиз, Раунд) Экспорт
	
	Макет = РегистрыСведений.РезультатыКвиза.ПолучитьМакет("Печать");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезультатыКвиза.Команда КАК Команда,
	|	РезультатыКвиза.Вопрос КАК Вопрос,
	|	РезультатыКвиза.Ответ КАК Ответ,
	|	РезультатыКвиза.Принят КАК Принят,
	|	РезультатыКвиза.Вопрос.ЭталонныйОтвет КАК ЭталонныйОтвет
	|ИЗ
	|	РегистрСведений.РезультатыКвиза КАК РезультатыКвиза
	|ГДЕ
	|	РезультатыКвиза.Квиз = &Квиз
	|	И РезультатыКвиза.Раунд = &Раунд";
	
	Запрос.УстановитьПараметр("Квиз", Квиз);
	Запрос.УстановитьПараметр("Раунд", Раунд);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаписатьРезультатыРаунда(Квиз, Раунд, ТаблицаСвойств) Экспорт
	
	НаборЗаписей = РегистрыСведений.РезультатыКвиза.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Квиз.Установить(Квиз);  
	НаборЗаписей.Отбор.Раунд.Установить(Раунд); 
	Для Каждого СтрокаТаблицы Из ТаблицаСвойств Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Квиз = Квиз;    
		НоваяЗапись.Раунд = Раунд; 
		
		НоваяЗапись.Команда = СтрокаТаблицы.Команда; 
		НоваяЗапись.Вопрос = СтрокаТаблицы.Вопрос; 
		НоваяЗапись.Ответ = СтрокаТаблицы.Ответ; 
		НоваяЗапись.Принят = СтрокаТаблицы.Принят; 
	КонецЦикла; 
	НаборЗаписей.Записать(); 
	
КонецПроцедуры
